{
  "welcome": "Welcome to Sarajevo Shadows - A Text Adventure Game!",
  "mission": "Hello, {playerName}. Your mission is to navigate Sarajevo and deal with the hooligans.\nEnter your choice by typing 1, 2, or 3!",
  "marketSquare_intro": "\nScene 1: Market Square\nYou see shopkeepers packing up. There’s a broom handle nearby.",
  "marketSquare_choices": "1. Help the shopkeepers (gain info).\n2. Take the broom handle (gain a weapon).",
  "marketSquare_help": "You help the shopkeepers. They thank you and reveal hooligans are at Latin Bridge or eating cevapi near Sebilj.",
  "marketSquare_key": "One shopkeeper hands you a mysterious key as a token of gratitude.",
  "marketSquare_weapon": "You pick up the broom handle as a weapon.",
  "marketSquare_next": "\nWhere would you like to go?\n1. Latin Bridge\n2. Sebilj",
  "latinBridge_intro": "\nScene 2: Latin Bridge\nYou approach the Latin Bridge. The hooligans spot you immediately.",
  "latinBridge_fight": "You try to fight back with your weapon, but you are outnumbered and overwhelmed.",
  "latinBridge_defeat": "Unarmed and unprepared, you are overpowered by the hooligans.",
  "sebilj_intro": "\nScene 2: Sebilj\nA beggar approaches you and asks for 1 mark.",
  "sebilj_choices": "1. Give him 1 mark.\n2. Ignore him.\n3. Offer the mysterious key.",
  "sebilj_beggar_yes": "The beggar thanks you profusely and blesses you.",
  "sebilj_beggar_no": "The beggar walks away, muttering under his breath.",
  "sebilj_beggar_key": "The beggar examines the key and tells you that you can use the key at a nearby buregdzinca.",
  "sebilj_food": "\nYou are hungry. What would you like to eat?\n1. Cevapi\n2. Burek",
  "sebilj_cevapi": "You head to eat cevapi. The hooligans have taken over the cevabdzinca and ambush you. You are killed.",
  "sebilj_burek": "\nYou enjoy a delicious burek and meet your good friend Ahmed.",
  "sebilj_ahmed": "Would you like to invite Ahmed to join you?\n1. Yes\n2. No",
  "sebilj_key": "3. Give the burek majstor the key to receive an awesome sword.",
  "sebilj_ahmed_yes": "Ahmed agrees to join you. You now have an ally. People around whisper that hooligans are gathering near Vijećnica.",
  "sebilj_ahmed_no": "You decide to eat the burek alone. People around whisper that hooligans are gathering near Vijećnica.",
  "sebilj_sword": "You give the burek majstor the key, and he gives you an awesome sword.",
  "cityHall_intro": "\nScene 3: Vijećnica (Final Confrontation)\nYou arrive at Vijećnica, where the hooligans are waiting to ambush you.",
  "cityHall_sword": "With the sword you got, you easily killed every hooligan!",
  "cityHall_noAhmed": "Without Ahmed’s help, you are outnumbered and overpowered.",
  "cityHall_attack": "Would you like to launch a surprise attack?\n1. Yes\n2. No",
  "cityHall_ahmed": "You and Ahmed launch a surprise attack. Ahmed fights bravely but is killed in the scuffle.",
  "cityHall_beggar": "The beggar you helped earlier appears out of nowhere and fights off the remaining hooligans with you!",
  "cityHall_defeat": "Outnumbered and exhausted, you are overwhelmed by the hooligans.",
  "cityHall_ambush": "You hesitate, and the hooligans ambush you.",
  "end_victory": "Congratulations! You defended Sarajevo and survived the night!",
  "end_defeat": "Game Over! You fought bravely but were defeated.",
  "end_replay": "\nWould you like to play again? (1 - yes, 2 - no)",
  "end_exit": "Thank you for playing Sarajevo Shadows!"
}
